package by.it_academy.homework5;

public class Homework5 {
    public static void main(String[] args) {
      /*  exercise1();
        exercise2();
        exercise3();
        exercise4();
        exercise5();
        exercise55();
        exercise6();
        exercise7();
        exercise8();
        exercise9();
       */
    }

    /* Задача 1
    Продолжи последовательность:
    1. Определить закономерность, согласно которой формируется та или иная числовая последовательность.
    2. Написать функцию, которая формирует первые N элементов данной последовательности в виде целочисленного
    массива и выводит элементы массива на экран:
            1, -2,  3,  -4,   5,  -6…
            1,  0,  2,   0,   3,   0,  4....*/

    /* Задача 2
    Заменить каждый элемент массива с нечетным индексом на ноль. */

    /* Задача 3
    Является ли массив возрастающей последовательностью: создайте массив из 4 случайных целых чисел
    из отрезка [10;99], выведите его на экран в строку. Далее определите и выведите на экран сообщение
    о том, является ли массив строго возрастающей последовательностью. */

    /* Задача 4
    Напишите класс, который заполняет случайными двузначными числами массив, размер которого при инициализации
    вводится с клавиатуры. После заполнения класс должен вывести на экран значения массива следующим образом:
    в первой строке - значения из четных ячеек массива;
    во второй строке - значения из нечетных ячеек массива. */

    /* Задача 5
    Напишите метод, который принимает два параметра: массив целых чисел М и еще одно целое число Х.
    Метод проверяет, находится ли число Х в массиве. */

    /* Задача 6*
    Создать второй массив из четных элементов первого массива.
    Условие задачи:
    1. Пользователь должен ввести с клавиатуры размер массива - натуральное число больше 3.
    Введенное пользователем число сохраняется в переменную n.
    2. Если пользователь ввёл не подходящее число, то программа должна просить пользователя повторить ввод.
    3. Создать массив из n случайных целых чисел из отрезка [0;n] и вывести его на экран.
    4. Создать второй массив только из чётных элементов первого массива, если они там есть, и вывести его на экран.*/

    /* Задача 7*
    Напишите метод, который получает в качестве параметра массив и заполняет его положительными
    случайными двузначными числами так, чтобы первая и вторая половины массива были идентичными.*/

}